# Exerxises 1

3) Create a function named get_db_url. 

It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [132]:
import pandas as pd
from sqlalchemy import text, create_engine
import numpy as np
from env import get_connection
from pydataset import data

4) Use your function to obtain a connection to the employees database.

In [263]:
url = get_connection('employees')

In [264]:
engine =  create_engine(url)

5) Once you have successfully run a query:

In [135]:
query = '''
        SELECT *
        FROM employees
        '''

In [136]:
text_query = text(query)

In [137]:
df = pd.read_sql(text(query), engine.connect())
df.head(10)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

# A.
Intentionally make a typo in the database url. What kind of error message do you see?

OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'somerville_2278'@'%%' to database 'emploees'")

(Background on this error at: https://sqlalche.me/e/14/e3q8)

# B. 
Intentionally make an error in your SQL query. What does the error message look like?

ProgrammingError: (pymysql.err.ProgrammingError) (1146, "Table 'employees.emploees' doesn't exist")

[SQL: 
        Select *
        From emploees
        ]
        
(Background on this error at: https://sqlalche.me/e/14/f405)

6) Read the employees and titles tables into two separate DataFrames.

In [138]:
query = '''
        SELECT *
        FROM employees
        '''

In [139]:
employees_df = pd.read_sql(text_query, engine.connect())
employees_df.head(10)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

In [140]:
query = '''
        SELECT *
        FROM titles
        '''

In [141]:
titles_df = pd.read_sql(text(query), engine.connect())
titles_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

7) How many rows and columns do you have in each DataFrame? Is that what you expected?

In [142]:
#employees
employees_df.shape

(300024, 6)

In [143]:
#titles
titles_df.shape

(443308, 4)

8) Display the summary statistics for each DataFrame.

In [144]:
#employees
employees_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300024 entries, 0 to 300023
Data columns (total 6 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   emp_no      300024 non-null  int64
 1   birth_date  300024 non-null  object
 2   first_name  300024 non-null  object
 3   last_name   300024 non-null  object
 4   gender      300024 non-null  object
 5   hire_date   300024 non-null  object
dtypes: int64(1), object(5)
memory usage: 13.7+ MB

In [145]:
#titles
titles_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

9) How many unique titles are in the titles DataFrame?

In [146]:
titles_df.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

10) What is the oldest date in the to_date column?

In [147]:
titles_df.to_date.max()

datetime.date(9999, 1, 1)

11) What is the most recent date in the to_date column?

In [148]:
titles_df.to_date.min()

datetime.date(1985, 3, 1)

# Exercises II

1) Copy the users and roles DataFrames from the examples above.

In [149]:
employees_df

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [150]:
titles_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

2) What is the result of using a right join on the DataFrames?

In [151]:
employees_df.merge(titles_df, how = 'right', left_on = 'emp_no', right_on = 'emp_no')

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

3) What is the result of using an outer join on the DataFrames?

In [152]:
employees_df.merge(titles_df, how = 'outer', left_on = 'emp_no', right_on = 'emp_no')

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01
...,...,...,...,...,...,...,...,...,...
443303,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Engineer,1987-08-30,1992-08-29
443304,499997,1961-08-03,Berhard,Lenart,M,1986-04-21,Senior Engineer,1992-08-29,9999-01-01
443305,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Senior Staff,1998-12-27,9999-01-01
443306,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,Staff,1993-12-27,1998-12-27
443307,499999,1958-05-01,Sachin,Tsukuda,M,1997-11-30,Engineer,1997-11-30,9999-01-01

4) What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [153]:
titles_df.drop(columns = ['emp_no'])
employees_df.drop(columns = ['emp_no']).merge(titles_df, how = 'outer', left_on = 'hire_date', right_on = 'from_date')

,birth_date,first_name,last_name,gender,hire_date,emp_no,title,from_date,to_date
0,1953-09-02,Georgi,Facello,M,1986-06-26,10001,Senior Engineer,1986-06-26,9999-01-01
1,1953-09-02,Georgi,Facello,M,1986-06-26,27425,Engineer,1986-06-26,1994-01-28
2,1953-09-02,Georgi,Facello,M,1986-06-26,29250,Staff,1986-06-26,1995-06-26
3,1953-09-02,Georgi,Facello,M,1986-06-26,35565,Staff,1986-06-26,1995-06-26
4,1953-09-02,Georgi,Facello,M,1986-06-26,50733,Engineer,1986-06-26,1994-11-16
...,...,...,...,...,...,...,...,...,...
19950858,NaN,NaN,NaN,NaN,NaN,479976,Senior Engineer,2001-05-27,9999-01-01
19950859,NaN,NaN,NaN,NaN,NaN,481162,Senior Engineer,2001-05-27,9999-01-01
19950860,NaN,NaN,NaN,NaN,NaN,487052,Senior Staff,2001-05-27,9999-01-01
19950861,NaN,NaN,NaN,NaN,NaN,496696,Senior Staff,2001-05-27,9999-01-01
19950862,NaN,NaN,NaN,NaN,NaN,496860,Senior Staff,2001-05-27,9999-01-01

5) Load the mpg dataset from PyDataset.

In [154]:
mpg = data('mpg')

6) Output and read the documentation for the mpg dataset.

In [155]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

7) How many rows and columns are in the dataset?

In [156]:
mpg.shape

(234, 11)

8) Check out your column names and perform any cleanup you may want on them.

In [157]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

9) Display the summary statistics for the dataset.

In [262]:
round(mpg.describe())

       displ    year    cyl    cty    hwy  mileage_difference  average_mileage
count  234.0   234.0  234.0  234.0  234.0               234.0            234.0
mean     3.0  2004.0    6.0   17.0   23.0                 7.0             20.0
std      1.0     5.0    2.0    4.0    6.0                 2.0              5.0
min      2.0  1999.0    4.0    9.0   12.0                 2.0             10.0
25%      2.0  1999.0    4.0   14.0   18.0                 5.0             16.0
50%      3.0  2004.0    6.0   17.0   24.0                 7.0             20.0
75%      5.0  2008.0    8.0   19.0   27.0                 8.0             24.0
max      7.0  2008.0    8.0   35.0   44.0                12.0             40.0

10) How many different manufacturers are there?

In [159]:
mpg.manufacturer.nunique()

15

11) How many different models are there?

In [160]:
mpg.model.nunique()

38

12) Create a column named mileage_difference like you did in the DataFrames exercises; 

this column should contain the difference between highway and city mileage for each car.

In [161]:
mpg['mileage_difference'] = mpg.hwy - mpg.cty
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

13) Create a column named average_mileage like you did in the DataFrames exercises; 

this is the mean of the city and highway mileage.

In [162]:
mpg['average_mileage'] = (mpg.hwy + mpg.cty)/2
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

14) Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [163]:
mpg['is_automatic'] = mpg.trans.str.contains('auto', case=False )
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

15) Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [164]:
round(mpg.groupby('manufacturer').average_mileage.agg('mean')).sort_values().tail(1)

manufacturer
honda    28.0
Name: average_mileage, dtype: float64

16) Do automatic or manual cars have better miles per gallon?

In [165]:
mpg['auto_or_man'] = np.where(mpg['trans'].str.startswith('a'), 'auto', 'manual')

In [166]:
#The mean of the of every auto transmission
avg_auto_mileage = round(mpg.loc[mpg['auto_or_man'] == 'auto', 'average_mileage'].mean())

In [167]:
#The mean of the of every manual transmission
avg_man_mileage = round(mpg.loc[mpg['auto_or_man'] == 'manual', 'average_mileage'].mean())

In [168]:
#Manual cars have better miles per gallon than automatic cars
avg_man_mileage > avg_auto_mileage

True

# Exercises III

1) Use your get_db_url function to help you explore the data from the chipotle database.

In [203]:
url = get_connection('chipotle')

In [204]:
engine =  create_engine(url)

In [205]:
query = '''
        SELECT *
        FROM orders
        '''

In [206]:
text_query = text(query)

In [207]:
orders = pd.read_sql(text(query), engine.connect())

In [208]:
orders.head(10)

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
5,6,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sour Cream, Guacamole, Lettuce]]",$10.98
6,7,3,1,Side of Chips,nan,$1.69
7,8,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables, Black Beans, Pinto Beans, Cheese, Sour...",$11.75
8,9,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Cheese, Sour Cream, Lettuce]]",$9.25
9,10,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto Beans, Cheese, Sour Cream, Lettuce]]",$9.25

2) What is the total price for each order?

In [209]:
orders['total_orders'] = (orders.quantity) * (orders.item_price.str.replace('$', '').astype(float))
orders.head(10)

/var/folders/7d/j3xl67tj7_182fyw9tbm3rkm0000gn/T/ipykernel_36856/1684750952.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  orders['total_orders'] = (orders.quantity) * (orders.item_price.str.replace('$', '').astype(float))

,id,order_id,quantity,item_name,choice_description,item_price,total_orders
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39,2.39
1,2,1,1,Izze,[Clementine],$3.39,3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98,33.96
5,6,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sour Cream, Guacamole, Lettuce]]",$10.98,10.98
6,7,3,1,Side of Chips,nan,$1.69,1.69
7,8,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables, Black Beans, Pinto Beans, Cheese, Sour...",$11.75,11.75
8,9,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Cheese, Sour Cream, Lettuce]]",$9.25,9.25
9,10,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto Beans, Cheese, Sour Cream, Lettuce]]",$9.25,9.25

3) What are the most popular 3 items?

In [210]:
orders.groupby('item_name').quantity.sum().sort_values().tail(3)

item_name
Chips and Guacamole    506
Chicken Burrito        591
Chicken Bowl           761
Name: quantity, dtype: int64

4) Which item has produced the most revenue?

In [ ]:
orders.item_price = orders.item_price.str.replace('$', '').astype(float)

In [220]:
orders.groupby('item_name').item_price.sum().sort_values().tail(1)

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64

5) Join the employees and titles DataFrames together.

In [301]:
employees = employees_df.merge(titles_df, how = 'inner', left_on = 'emp_no', right_on = 'emp_no')

6) For each title, find the hire date of the employee that was hired most recently with that title.

In [255]:
employees.groupby('title').from_date.max()

title
Assistant Engineer    2000-02-01
Engineer              2002-08-01
Manager               1996-08-30
Senior Engineer       2002-08-01
Senior Staff          2002-08-01
Staff                 2000-02-01
Technique Leader      2000-02-01
Name: from_date, dtype: object

7) Write the code necessary to create a cross tabulation of the number of titles by department. 

(Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [277]:
query = '''
        SELECT *
        FROM departments
        '''

In [278]:
departments_df = pd.read_sql(text(query), engine.connect())

In [281]:
query = '''
        SELECT *
        FROM dept_emp
        '''

In [282]:
dept_emp_df = pd.read_sql(text(query), engine.connect())

In [304]:
employees = employees_df.merge(dept_emp_df, how = 'inner', left_on = 'emp_no', right_on = 'emp_no')

In [306]:
employees = employees.merge(departments_df, how = 'inner', left_on = 'dept_no', right_on = 'dept_no')

In [308]:
employees = employees.merge(titles_df, how = 'inner', left_on = 'emp_no', right_on = 'emp_no')

In [309]:
employees

,emp_no,birth_date,first_name,last_name,gender,hire_date,dept_no,from_date_x,to_date_x,dept_name,title,from_date_y,to_date_y
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,d005,1986-06-26,9999-01-01,Development,Senior Engineer,1986-06-26,9999-01-01
1,10006,1953-04-20,Anneke,Preusig,F,1989-06-02,d005,1990-08-05,9999-01-01,Development,Senior Engineer,1990-08-05,9999-01-01
2,10008,1958-02-19,Saniya,Kalloufi,M,1994-09-15,d005,1998-03-11,2000-07-31,Development,Assistant Engineer,1998-03-11,2000-07-31
3,10012,1960-10-04,Patricio,Bridgland,M,1992-12-18,d005,1992-12-18,9999-01-01,Development,Engineer,1992-12-18,2000-12-18
4,10012,1960-10-04,Patricio,Bridgland,M,1992-12-18,d005,1992-12-18,9999-01-01,Development,Senior Engineer,2000-12-18,9999-01-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...
489898,499950,1964-07-15,Weidon,Gente,F,1991-06-05,d002,1999-02-02,2000-02-23,Finance,Staff,1999-02-02,2000-02-23
489899,499977,1956-06-05,Martial,Weisert,F,1996-09-17,d002,1999-12-28,9999-01-01,Finance,Staff,1999-12-28,9999-01-01
489900,499989,1954-05-26,Keiichiro,Lindqvist,M,1993-10-28,d002,1996-10-29,2001-03-07,Finance,Senior Staff,1996-10-29,2001-03-07
489901,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,d002,1993-12-27,9999-01-01,Finance,Senior Staff,1998-12-27,9999-01-01
489902,499998,1956-09-05,Patricia,Breugel,M,1993-10-13,d002,1993-12-27,9999-01-01,Finance,Staff,1993-12-27,1998-12-27

In [310]:
pd.crosstab(employees.title, employees.dept_name)

dept_name,Customer Service,Development,Finance,Human Resources,Marketing,Production,Quality Management,Research,Sales
title,,,,,,,,,
Assistant Engineer,298,7769,0,0,0,6445,1831,378,0
Engineer,2362,58135,0,0,0,49649,13852,2986,0
Manager,4,2,2,2,2,4,4,2,2
Senior Engineer,2027,49326,0,0,0,42205,11864,2570,0
Senior Staff,13925,1247,12139,12274,13940,1270,0,11637,36191
Staff,16150,1424,13929,14342,16196,1478,0,13495,41808
Technique Leader,309,7683,0,0,0,6557,1795,393,0

In [311]:
employees.title.value_counts()

Engineer              126984
Staff                 118822
Senior Engineer       107992
Senior Staff          102623
Technique Leader       16737
Assistant Engineer     16721
Manager                   24
Name: title, dtype: int64

In [316]:
pd.crosstab(employees.title, employees.dept_name).sum(axis = 1).sort_values(ascending = False)

title
Engineer              126984
Staff                 118822
Senior Engineer       107992
Senior Staff          102623
Technique Leader       16737
Assistant Engineer     16721
Manager                   24
dtype: int64